app/Models/BiddingModel.php

    public function getHighestBidByProduct($productId)
    {
        return $this->db->table('bids')
            ->select('MAX(bid_amount) AS highest_bid')
            ->where('product_id', $productId)
            ->where('status', 'active')
            ->get()
            ->getRow();
---
SELECT MAX(bid_amount) AS highest_bid
FROM `bids`
WHERE `product_id` = '48'
AND `status` = 'active'

    public function getAcceptedBidByProduct($productId)
    {
        return $this->db->table('bids')
            ->where('product_id', $productId)
            ->where('status', 'accepted')
            ->get()
            ->getRow();
---
SELECT *
FROM `bids`
WHERE `product_id` = '48'
AND `status` = 'accepted'