app/Models/CartModel.php

SELECT `c`.*, `ci`.*, `c`.`id` AS `cart_id`, `ci`.`id` AS `item_id`, (SELECT CONCAT(username, '|||', slug) FROM users WHERE users.id = ci.seller_id) AS seller_info
FROM `carts` `c`
LEFT JOIN `cart_items` `ci` ON `c`.`id` = `ci`.`cart_id`
WHERE `c`.`user_id` = '1'
---
    public function fetchRawCartData()
    {
        $userId = 0;
        $cartSessionId = '';

        if (authCheck()) {
            $userId = user()->id;
        } else {
            $cartSessionId = helperGetSession('cartSessionId');
        }

        if (!$userId && !$cartSessionId) {
            return null;
        }

        $builder = $this->db->table("carts c")
            ->select("c.*, ci.*, c.id AS cart_id, ci.id AS item_id, (SELECT CONCAT(username, '|||', slug) FROM users WHERE users.id = ci.seller_id) AS seller_info")
            ->join("cart_items ci", "c.id = ci.cart_id", "left");

        if ($userId) {
            $builder->where('c.user_id', $userId);
        } else {
            $builder->where('c.session_id', $cartSessionId);
        }

        $results = $builder->get()->getResultObject();

UPDATE `carts` SET `exchange_rate` = '1'
WHERE `id` = 238
---
        $shippingData = safeJsonDecode($results[0]->shipping_data ?? '');

        //set exchange rate and location
        $this->builderCarts->where('id', $cartId)->update([
            'exchange_rate' => $currency->exchange_rate
        ]);

UPDATE `cart_items` SET `item_hash` = 'e5cf0b769430543cca70f4ef7a0efaca', `product_id` = '41', `product_option_variants_id` = '0', `seller_id` = '1', `product_type` = 'physical', `listing_type` = 'sell_on_site', `product_title` = 'Gucci nylon fabric smart backpack', `product_sku` = 'H1K1RGO137', `quantity` = '4', `unit_price` = '1', `unit_price_base` = '1', `total_price` = '4', `product_vat` = 0, `product_vat_rate` = 0, `product_image_id` = '8', `product_image_data` = '{\"path\":\"202511/img_w480_692447fd4a3956-56362818.webp\",\"storage\":\"local\"}', `purchase_type` = 'product', `quote_request_id` = '0', `variant_hash` = NULL, `extra_options` = NULL, `extra_options_hash` = '{}', `product_options_snapshot` = NULL, `product_options_summary` = '', `is_stock_available` = 1, `bid_id` = NULL
WHERE `id` = '347'
---

            unset($updateArray['id'], $updateArray['cart_id'], $updateArray['created_at']);

            $this->builderCartItems->where('id', $cartItem->id)->update($updateArray);