app/Models/ChatModel.php

    public function getUnreadChatsCount($userId)
    {
        return $this->builderMessages
            ->join('chat', 'chat.id = chat_messages.chat_id')
            ->where('chat_messages.receiver_id', $userId)
            ->where('chat_messages.is_read', 0)
            ->where('chat_messages.deleted_user_id', 0)
            ->groupStart()
                ->where('chat.sender_id', $userId)
                ->orWhere('chat.receiver_id', $userId)
            ->groupEnd()
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `chat_messages`
JOIN `chat` ON `chat`.`id` = `chat_messages`.`chat_id`
WHERE `chat_messages`.`receiver_id` = '1'
AND `chat_messages`.`is_read` = 0
AND `chat_messages`.`deleted_user_id` = 0
AND   (
`chat`.`sender_id` = '1'
OR `chat`.`receiver_id` = '1'
 )