app/Models/CommonModel.php

SELECT *
FROM `slider`
WHERE `lang_id` = 1
ORDER BY `item_order`
---
    public function getSliderItemsByLang($langId)
    {
        return getCacheData('slider_' . $langId, function () use ($langId) {
            return $this->builderSlider->where('lang_id', clrNum($langId))->orderBy('item_order')->get()->getResult();

SELECT *
FROM `ad_spaces`
---
    public function getAdSpaces()
    {
        return getCacheData('ad_spaces', function () {
            return $this->builderAds->get()->getResult();
        }, 'static');

SELECT COUNT(*) AS `numrows`
FROM `reviews`
JOIN `users` ON `users`.`id` = `reviews`.`user_id`
WHERE `reviews`.`product_id` = 48
---
    public function getReviewsCountByProductId($productId)
    {
        return $this->builderReviews->join('users', 'users.id = reviews.user_id')->where('reviews.product_id', clrNum($productId))->countAllResults();

SELECT `reviews`.*, `users`.`username` AS `user_username`, `users`.`slug` AS `user_slug`, `users`.`avatar` AS `user_avatar`, `users`.`storage_avatar` AS `user_storage_avatar`
FROM `reviews`
JOIN `users` ON `users`.`id` = `reviews`.`user_id`
JOIN `products` ON `products`.`id` = `reviews`.`product_id`
WHERE `products`.`id` = 48
ORDER BY `reviews`.`created_at` DESC
 LIMIT 10
---
    public function getProductReviewsByOffset($productId, $perPage, $offset)
    {
        return $this->builderReviews->join('users', 'users.id = reviews.user_id')->join('products', 'products.id = reviews.product_id')
            ->select('reviews.*, users.username AS user_username, users.slug AS user_slug, users.avatar AS user_avatar, users.storage_avatar AS user_storage_avatar')
            ->where('products.id', clrNum($productId))->orderBy('reviews.created_at DESC')->limit($perPage, $offset)->get()->getResult();

SELECT `comments`.*, `users`.`username` AS `user_username`, `users`.`slug` AS `user_slug`, `users`.`avatar` AS `user_avatar`, `users`.`storage_avatar` AS `user_storage_avatar`
FROM `comments`
LEFT JOIN `users` ON `comments`.`user_id` = `users`.`id`
WHERE `comments`.`product_id` = 48
AND `comments`.`parent_id` = 0
AND `comments`.`status` = 1
ORDER BY `comments`.`id` DESC
 LIMIT 10
---
    public function getProductCommentsByOffset($productId, $perPage, $offset)
    {
        $arrayComments = [];
        $parentIds = [];
        $this->builderComments->select('comments.*, users.username AS user_username, users.slug AS user_slug, users.avatar AS user_avatar, users.storage_avatar AS user_storage_avatar')
            ->join('users', 'comments.user_id = users.id', 'left')->where('comments.product_id', clrNum($productId))->where('comments.parent_id', 0);
        if ($this->generalSettings->comment_approval_system == 1) {
            $this->builderComments->where('comments.status', 1);
        }
        $parentResult = $this->builderComments->orderBy('comments.id', 'DESC')->limit($perPage, $offset)->get()->getResult();

SELECT COUNT(*) AS `numrows`
FROM `comments`
WHERE `product_id` = 48
AND `parent_id` = 0
AND `status` = 1
---
    public function getProductCommentCount($productId)
    {
        return $this->builderComments->where('product_id', clrNum($productId))->where('parent_id', 0)->where('status', 1)->countAllResults();