app/Models/ForumCategoryModel.php

SELECT `fc`.*, COUNT(DISTINCT ft.id) AS thread_count, COALESCE(MAX(rc.replies_count), 0) AS max_replies
FROM `forum_categories` `fc`
LEFT JOIN `forum_threads` `ft` ON `ft`.`category_id` = `fc`.`id`
LEFT JOIN (SELECT thread_id, COUNT(*) AS replies_count 
              FROM forum_posts 
              GROUP BY thread_id) rc ON `rc`.`thread_id` = `ft`.`id`
GROUP BY `fc`.`id`
ORDER BY `max_replies` DESC, `thread_count` DESC
---
public function getTopCategories()
{
    return $this->db->table('forum_categories fc')
        ->select('
            fc.*,
            COUNT(DISTINCT ft.id) AS thread_count,
            COALESCE(MAX(rc.replies_count), 0) AS max_replies
        ')
        ->join('forum_threads ft', 'ft.category_id = fc.id', 'left')
        ->join(
            '(SELECT thread_id, COUNT(*) AS replies_count
              FROM forum_posts
              GROUP BY thread_id) rc',
            'rc.thread_id = ft.id',
            'left'
        )
        ->groupBy('fc.id')
        ->orderBy('max_replies', 'DESC')
        ->orderBy('thread_count', 'DESC')
        ->get()
        ->getResultArray();