app/Models/ProductModel.php

SELECT *
FROM `products`
WHERE `is_promoted` = 1
---
    public function checkPromotedProducts()
    {
        $products = $this->builder->where('is_promoted', 1)->get()->getResult();

SELECT *
FROM `product_details`
WHERE `product_id` = 48
AND `lang_id` = 1
---
    public function getProductDetails($id, $langId, $getMainOnNull = true)
    {
        $row = $this->builderProductDetails->where('product_id', clrNum($id))->where('lang_id', clrNum($langId))->get()->getRow();

SELECT COUNT(*) AS `numrows`
FROM `wishlist`
WHERE `product_id` = 48
---
    public function getProductWishlistCount($productId)
    {
        return $this->builderWishlist->where('product_id', clrNum($productId))->countAllResults();

UPDATE `products` SET `pageviews` = 503
WHERE `id` = '48'
---
    public function increaseProductPageviews($product)
    {
        if (!empty($product)) {
            if (empty(helperGetSession('pr_' . $product->id))) {
                helperSetSession('pr_' . $product->id, '1');
                $this->builder->where('id', $product->id)->update(['pageviews' => $product->pageviews + 1]);

SELECT COUNT(*) AS `numrows`
FROM `variant_coupons`
WHERE `product_option_variants_id` = '231'
SELECT COUNT(*) AS `numrows`
FROM `variant_coupons`
WHERE `product_option_variants_id` = '231'
AND `status` = 'active'
---
    public function areAllVariantCouponsInactive($variantId)
    {
        $db = \Config\Database::connect();

        $total = $db->table('variant_coupons')
            ->where('product_option_variants_id', $variantId)
            ->countAllResults();

        $active = $db->table('variant_coupons')
            ->where('product_option_variants_id', $variantId)
            ->where('status', 'active')
            ->countAllResults();