app/Models/ProductOptionsModel.php

    private function loadOptionsForProduct(int $productId): array
    {
        $optionsData = [];
        $optionsResult = $this->db->table('product_options')
            ->select('id, option_key, option_name_translations, option_type, display_order, is_active')
            ->where('product_id', $productId)
            ->orderBy('display_order', 'ASC')
            ->get()->getResultObject();
---
SELECT `id`, `option_key`, `option_name_translations`, `option_type`, `display_order`, `is_active`
FROM `product_options`
WHERE `product_id` = 48
ORDER BY `display_order` ASC

    private function loadValuesForOption(int $optionId): array
    {
        $valuesData = [];
        $optionValuesResult = $this->db->table('product_option_values')
            ->select('id, value_key, value_name_translations, color_code, primary_swatch_image_id, gallery_image_ids, display_order')
            ->where('option_id', $optionId)
            ->orderBy('display_order', 'ASC')
            ->get()->getResultObject();
---
SELECT `id`, `value_key`, `value_name_translations`, `color_code`, `primary_swatch_image_id`, `gallery_image_ids`, `display_order`
FROM `product_option_values`
WHERE `option_id` = 8
ORDER BY `display_order` ASC

    private function loadVariantsForProduct(int $productId, bool $onlyActiveVariants = false): array
    {
        $variantsData = [];
        $builder = $this->db->table('product_option_variants')
            ->select('id, variant_hash, sku, price, price_discounted, quantity, weight, is_default, is_active')
            ->where('product_id', $productId);

        if ($onlyActiveVariants) {
            $builder->where('is_active', 1);
        }

        $variantsResult = $builder->get()->getResultObject();

        foreach ($variantsResult as $variantRow) {
            $variantComposition = $this->loadCompositionForVariant($variantRow->id);

            if (!empty($variantComposition['value_ids'])) {
                sort($variantComposition['value_ids'], SORT_NUMERIC);
                $couponRows = $this->db->table('variant_coupons')
                    ->where('product_option_variants_id', $variantRow->id)
                    ->orderBy('id', 'ASC')
                    ->get()
                    ->getResultArray();
---
SELECT `id`, `variant_hash`, `sku`, `price`, `price_discounted`, `quantity`, `weight`, `is_default`, `is_active`
FROM `product_option_variants`
WHERE `product_id` = 48
AND `is_active` = 1
SELECT *
FROM `variant_coupons`
WHERE `product_option_variants_id` = '231'
ORDER BY `id` ASC

    private function loadCompositionForVariant(int $variantId): array
    {
        $valueNames = [];
        $valueIds = [];

        $variantValuesResult = $this->db->table('product_option_variant_values pvov')
            ->select('pov.id as value_server_id, pov.value_name_translations')
            ->join('product_option_values pov', 'pvov.value_id = pov.id')
            ->join('product_options po', 'pov.option_id = po.id')
            ->where('pvov.variant_id', $variantId)
            ->orderBy('po.display_order', 'ASC')
            ->orderBy('pov.display_order', 'ASC')
            ->get()->getResultObject();
---
SELECT `pov`.`id` as `value_server_id`, `pov`.`value_name_translations`
FROM `product_option_variant_values` `pvov`
JOIN `product_option_values` `pov` ON `pvov`.`value_id` = `pov`.`id`
JOIN `product_options` `po` ON `pov`.`option_id` = `po`.`id`
WHERE `pvov`.`variant_id` = 231
ORDER BY `po`.`display_order` ASC, `pov`.`display_order` ASC

    public function getFormattedProductImages(int $productId): array
    {
        $imagesResult = $this->db->table('images')
            ->where('product_id', $productId)
            ->orderBy('is_main', 'DESC')
            ->orderBy('id', 'ASC')
            ->get()->getResultObject();
---
SELECT *
FROM `images`
WHERE `product_id` = 48
ORDER BY `is_main` DESC, `id` ASC

    public function getDefaultVariant(int $productId)
    {
        return $this->db->table('product_option_variants')->where('product_id', $productId)->where('is_active', 1)->orderBy('is_default DESC, id')->limit(1)->get()->getRow();
---
SELECT *
FROM `product_option_variants`
WHERE `product_id` = 48
AND `is_active` = 1
ORDER BY `is_default` DESC, `id`
 LIMIT 1

    public function getVariantImageIds(int $variantId): array
    {
        $result = $this->db->table('product_option_variant_values as vv')->select('v.gallery_image_ids')->join('product_option_values as v', 'v.id = vv.value_id')
            ->where('vv.variant_id', $variantId)->get()->getResultObject();
---
SELECT `v`.`gallery_image_ids`
FROM `product_option_variant_values` as `vv`
JOIN `product_option_values` as `v` ON `v`.`id` = `vv`.`value_id`
WHERE `vv`.`variant_id` = 231