app/Models/SettingsModel.php

    public function getSelectedFonts($settings)
    {
        return getCacheData('fonts_' . $settings->id, function () use ($settings) {

            $arrayFonts = array();
            $fonts = $this->builderFonts->whereIn('id', [clrNum($settings->site_font), clrNum($settings->dashboard_font)], false)->get()->getResult();
---
SELECT *
FROM `fonts`
WHERE id IN (24,18)